garyPenhook/PyAvrOCD/svd/atmega16m1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x00800075</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x9</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC</name>
          <description>ADC Data Register Bytes</description>
          <addressOffset>0x3</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC</name>
              <description>ADC Data bits</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRA</name>
          <description>The ADC Control and Status register (read-only for debugger)</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADPS</name>
              <description>ADC  Prescaler Select Bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADIE</name>
              <description>ADC Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIF</name>
              <description>ADC Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADATE</name>
              <description>ADC Auto Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSC</name>
              <description>ADC Start Conversion</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADTS</name>
              <description>ADC Auto Trigger Sources</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREE_RUNNING_MODE</name>
                  <description>Free Running mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANALOG_COMPARATOR</name>
                  <description>Analog Comparator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_INTERRUPT_REQUEST_0</name>
                  <description>External Interrupt Request 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER0_COMPARE_MATCH_A</name>
                  <description>Timer/Counter0 Compare Match A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER0_OVERFLOW</name>
                  <description>Timer/Counter0 Overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER1_COMPARE_MATCH_B</name>
                  <description>Timer/Counter1 Compare Match B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER1_OVERFLOW</name>
                  <description>Timer/Counter1 Overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_COUNTER1_CAPTURE_EVENT</name>
                  <description>Timer/Counter1 Capture Event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSC0ASY_EVENT</name>
                  <description>PSC0ASY Event</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSC1ASY_EVENT</name>
                  <description>PSC1ASY Event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSC2ASY_EVENT</name>
                  <description>PSC2ASY Event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANALOG_COMPARATOR_1</name>
                  <description>Analog comparator 1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANALOG_COMPARATOR_2</name>
                  <description>Analog comparator 2</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AREFEN</name>
              <description>Analog Reference pin Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRCEN</name>
              <description>Current Source Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADHSM</name>
              <description>ADC High Speed Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUX</name>
          <description>The ADC multiplexer Selection Register</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUX</name>
              <description>ADC channel selection bits</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>ADC input pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1</name>
                  <description>ADC input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2</name>
                  <description>ADC input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3</name>
                  <description>ADC input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC8</name>
                  <description>ADC input pin 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC9</name>
                  <description>ADC input pin 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10</name>
                  <description>ADC input pin 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE</name>
                  <description>Temperature sensor</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCC4</name>
                  <description>Internal VCC / 4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISRC</name>
                  <description>Current source</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMP0</name>
                  <description>Analog Differential Amplifier 0</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMP1</name>
                  <description>Analog Differential Amplifier 1</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMP2</name>
                  <description>Analog Differential Amplifier 2</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BNDGAP</name>
                  <description>Bandgap</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>0V (GND)</description>
                  <value>18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLAR</name>
              <description>Left Adjust Result</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFS</name>
              <description>Reference Selection Bits</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AREF_INTERNAL_VREF_TURNED_OFF</name>
                  <description>AREF, Internal Vref turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVCC_REFERENCE</name>
                  <description>AVCC reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL_2_56V_VOLTAGE_REFERENCE</name>
                  <description>Internal 2.56V Voltage Reference</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AMP0CSR</name>
          <description>Amplifier 0 Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AMP0TS</name>
              <description>Amplifier 0 Clock Source Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPCMP0</name>
              <description>Amplifier 0 - Comparator 0 connection</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP0G</name>
              <description>Amplifier 0 Gain Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMP0IS</name>
              <description>Amplifier 0 Input Shunt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP0EN</name>
              <description>Amplifier 0 Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMP1CSR</name>
          <description>Amplifier 1 Control and Status Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AMP1TS</name>
              <description>Amplifier 1 Clock Source Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPCMP1</name>
              <description>Amplifier 1 - Comparator 1 Connection</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP1G</name>
              <description>Amplifier 1 Gain Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMP1IS</name>
              <description>Amplifier 1 Input Shunt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP1EN</name>
              <description>Amplifier 1 Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMP2CSR</name>
          <description>Amplifier 2 Control and Status Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AMP2TS</name>
              <description>Amplifier 2 Clock Source Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPCMP2</name>
              <description>Amplifier 2 - Comparator 2 Connection</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP2G</name>
              <description>Amplifier 2 Gain Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMP2IS</name>
              <description>Amplifier 2 Input Shunt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP2EN</name>
              <description>Amplifier 2 Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC0D</name>
              <description>ADC0 Digital input Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1D</name>
              <description>ADC1 Digital input Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2D</name>
              <description>ADC2 Digital input Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC3D</name>
              <description>ADC3 Digital input Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC4D</name>
              <description>ADC4 Digital input Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC5D</name>
              <description>ADC5 Digital input Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC6D</name>
              <description>ADC6 Digital input Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC7D</name>
              <description>ADC7 Digital input Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR1</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC8D</name>
              <description>ADC8 Pin Digital input Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC9D</name>
              <description>ADC9 Pin Digital input Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10D</name>
              <description>ADC10 Pin Digital input Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP0ND</name>
              <description>AMP0N Pin Digital input Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP0PD</name>
              <description>AMP0P Pin Digital input Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP0D</name>
              <description>ACMP0 Pin Digital input Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP2PD</name>
              <description>AMP2P Pin Digital input Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
